Tekla.Structures.Catalogs.ProfileItemEnumerator
The ProfileItemEnumerator class allows to loop through the catalog profile items.
The following example returns true if a library profile item with the name HEA300 has been found:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool Result = false;
CatalogHandler CatalogHandler = new CatalogHandler();
if (CatalogHandler.GetConnectionStatus())
{
ProfileItemEnumerator ProfileItemEnumerator = CatalogHandler.GetLibraryProfileItems();
while (ProfileItemEnumerator.MoveNext())
{
LibraryProfileItem LibraryProfileItem = ProfileItemEnumerator.Current as LibraryProfileItem;
if (LibraryProfileItem.ProfileName == "HEA300")
{
Result = true;
break;
}
}
}
return Result;
}
}

Tekla.Structures.Catalogs.ProfileItemEnumerator.SelectInstances
Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator.
The user can set this to 'false' if no members are ever asked from the instance. This is the case
when, for example, asking only for the available profile names or when only certain profiles need
to be selected from the model. Without the selection the 'Current' item contains the profile name
or the prefix and the profile type. Warning: normally the user should not change this value.

Tekla.Structures.Catalogs.ProfileItemEnumerator.#ctor(Tekla.Structures.Catalogs.ProfileItemEnumerator.ProfileItemEnumeratorTypeEnum)
The constructor takes as parameter the filter for which items from the catalog
will enumerate without treestructure.
Type: Profile item type to enumerate

Tekla.Structures.Catalogs.ProfileItemEnumerator.#ctor
The default constructor will enumerate all profiles in catalog and fills treestructure.

Tekla.Structures.Catalogs.ProfileItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type ProfileItem.

Tekla.Structures.Catalogs.ProfileItemEnumerator.Current
Returns a profile item instance of the current element.

Tekla.Structures.Catalogs.ProfileItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.ProfileItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.ProfileItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.